{"class_name": "Model", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 20, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "lidar_input"}, "name": "lidar_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "lidar_conv1", "trainable": true, "batch_input_shape": [null, 20, 20, 20], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv1", "inbound_nodes": [[["lidar_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv2", "inbound_nodes": [[["lidar_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv3", "inbound_nodes": [[["lidar_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "lidar_add1", "trainable": true, "dtype": "float32"}, "name": "lidar_add1", "inbound_nodes": [[["lidar_conv3", 0, 0, {}], ["lidar_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "lidar_maxpool1", "inbound_nodes": [[["lidar_add1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lidar_dropout1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "lidar_dropout1", "inbound_nodes": [[["lidar_maxpool1", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 90, 160, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "img_input"}, "name": "img_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "lidar_conv4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv4", "inbound_nodes": [[["lidar_dropout1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv11", "trainable": true, "batch_input_shape": [null, 90, 160, 3], "dtype": "float32", "filters": 32, "kernel_size": [7, 7], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv11", "inbound_nodes": [[["img_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv5", "inbound_nodes": [[["lidar_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv3", "inbound_nodes": [[["img_conv11", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "lidar_add2", "trainable": true, "dtype": "float32"}, "name": "lidar_add2", "inbound_nodes": [[["lidar_conv5", 0, 0, {}], ["lidar_dropout1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv4", "inbound_nodes": [[["img_conv3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "lidar_maxpool2", "inbound_nodes": [[["lidar_add2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv5", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv5", "inbound_nodes": [[["img_conv4", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "coord_input"}, "name": "coord_input", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"name": "lidar_dropout2", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "lidar_dropout2", "inbound_nodes": [[["lidar_maxpool2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "img_add2", "trainable": true, "dtype": "float32"}, "name": "img_add2", "inbound_nodes": [[["img_conv5", 0, 0, {}], ["img_conv3", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "coord_conv1", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_conv1", "inbound_nodes": [[["coord_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv6", "inbound_nodes": [[["lidar_dropout2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "img_maxpool2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "img_maxpool2", "inbound_nodes": [[["img_add2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "coord_conv2", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_conv2", "inbound_nodes": [[["coord_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv7", "inbound_nodes": [[["lidar_conv6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "img_dropout2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "img_dropout2", "inbound_nodes": [[["img_maxpool2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "coord_maxpool1", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "coord_maxpool1", "inbound_nodes": [[["coord_conv2", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "lidar_add3", "trainable": true, "dtype": "float32"}, "name": "lidar_add3", "inbound_nodes": [[["lidar_conv7", 0, 0, {}], ["lidar_dropout2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv6", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv6", "inbound_nodes": [[["img_dropout2", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "coord_conv3", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_conv3", "inbound_nodes": [[["coord_maxpool1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "lidar_maxpool3", "trainable": true, "dtype": "float32", "pool_size": [1, 2], "padding": "valid", "strides": [1, 2], "data_format": "channels_last"}, "name": "lidar_maxpool3", "inbound_nodes": [[["lidar_add3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "img_conv7", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_conv7", "inbound_nodes": [[["img_conv6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "coord_conv4", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_conv4", "inbound_nodes": [[["coord_conv3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lidar_dropout3", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "lidar_dropout3", "inbound_nodes": [[["lidar_maxpool3", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "img_add3", "trainable": true, "dtype": "float32"}, "name": "img_add3", "inbound_nodes": [[["img_conv7", 0, 0, {}], ["img_dropout2", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "coord_maxpool2", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "same", "data_format": "channels_last"}, "name": "coord_maxpool2", "inbound_nodes": [[["coord_conv4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv8", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv8", "inbound_nodes": [[["lidar_dropout3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "img_maxpool3", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_last"}, "name": "img_maxpool3", "inbound_nodes": [[["img_add3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "coord_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "coord_flatten", "inbound_nodes": [[["coord_maxpool2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "lidar_conv9", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_conv9", "inbound_nodes": [[["lidar_conv8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "img_dropout3", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "img_dropout3", "inbound_nodes": [[["img_maxpool3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "coord_dense1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_dense1", "inbound_nodes": [[["coord_flatten", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "lidar_add4", "trainable": true, "dtype": "float32"}, "name": "lidar_add4", "inbound_nodes": [[["lidar_conv9", 0, 0, {}], ["lidar_dropout3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "img_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "img_flatten", "inbound_nodes": [[["img_dropout3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "coord_dropout1", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "coord_dropout1", "inbound_nodes": [[["coord_dense1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "lidar_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "lidar_flatten", "inbound_nodes": [[["lidar_add4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "img_dense1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_dense1", "inbound_nodes": [[["img_flatten", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "coord_dense2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_dense2", "inbound_nodes": [[["coord_dropout1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lidar_dense1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_dense1", "inbound_nodes": [[["lidar_flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "img_dropout4", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "img_dropout4", "inbound_nodes": [[["img_dense1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "coord_dropout2", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "coord_dropout2", "inbound_nodes": [[["coord_dense2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lidar_dropout4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "lidar_dropout4", "inbound_nodes": [[["lidar_dense1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "img_dense2", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "img_dense2", "inbound_nodes": [[["img_dropout4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "coord_dense22", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_dense22", "inbound_nodes": [[["coord_dropout2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "lidar_dense2", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "lidar_dense2", "inbound_nodes": [[["lidar_dropout4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "img_dropout5", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "img_dropout5", "inbound_nodes": [[["img_dense2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "coord_dropout22", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "coord_dropout22", "inbound_nodes": [[["coord_dense22", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "lidar_dropout5", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "lidar_dropout5", "inbound_nodes": [[["lidar_dense2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "coord_tanh", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_tanh", "inbound_nodes": [[["img_dropout5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "coord_output", "trainable": true, "dtype": "float32", "units": 64, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "coord_output", "inbound_nodes": [[["coord_dropout22", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["lidar_dropout5", 0, 0, {}], ["coord_tanh", 0, 0, {}], ["coord_output", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "bias_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0010000000474974513}}, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense3_fusion_coord_lid", "trainable": true, "dtype": "float32", "units": 64, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 9.999999747378752e-06, "l2": 9.999999747378752e-05}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense3_fusion_coord_lid", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}], "input_layers": [["lidar_input", 0, 0], ["img_input", 0, 0], ["coord_input", 0, 0]], "output_layers": [["dense3_fusion_coord_lid", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}